Bunkering_09/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 9.5050e-05; // background, from k/epsilon above (turbulence_initial_conditions.py)

boundaryField
{
    right               { type calculated; value $internalField; }
    left                { type calculated; value $internalField; }
    front               { type calculated; value $internalField; }
    back                { type calculated; value $internalField; }
    top                 { type calculated; value $internalField; }
    bottom              { type compressible::alphatWallFunction; Prt 0.85; value $internalField; }
    bunkering-boat_m    { type compressible::alphatWallFunction; Prt 0.85; value $internalField; }
    bunkering-quay_m    { type compressible::alphatWallFunction; Prt 0.85; value $internalField; }
    nozzle_holder_wall  { type compressible::alphatWallFunction; Prt 0.85; value $internalField; }
    nozzle              { type calculated; value uniform 8.7584e-03; }
}
// ************************************************************************* //
